import 'dart:math';

void main() {
  task1();
  task2();
  task3();
  task4();
  task5();
  task6();
  task7();
  task8();
  task9();
  task10();
}

/// Завдання 1: Математичні оператори
/// Створіть змінні довжина і ширина прямокутника (ширина 18.4, висота 30.9)
///
/// Обчисліть площу і периметр прямокутника.
/// Виведіть площу і периметр.
/// Використайте оператор ~/ для обчислення скільки повних квадратів 1х1 вміщається у площу.
void task1() {
  final width = 18.4;
  final height = 30.9;

  final area = width * height;
  final perimeter = 2 * (width + height);
  final fullSquares = area ~/ 1;

  print('Task 1: Математичні оператори');
  print(' Площа прямокутника: $area');
  print(' Периметр прямокутника: $perimeter');
  print(' Кількість повних квадратів 1х1 в площі: $fullSquares');
}

/// Завдання 2: Оператори порівняння
/// Створіть змінну number.
///
/// Перевірте:
/// Чи більше число за 50.
/// Чи менше число за 100.
/// Чи ділиться число на 5 без залишку.
/// Виведіть всі результати.
void task2() {
  const min = 20;
  const max = 200;
  final number = min + Random().nextInt((max + 1) - min) + min;

  print('Task 2: Оператори порівняння');
  if (number > 50) {
    print(' Число $number більше 50');
  }

  if (number < 100) {
    print(' Число $number менше 100');
  }

  if ((number % 5) == 0) {
    print(' Число $number ділиться на 5 без залишку');
  } else {
    print(' Число $number не ділиться на 5 без залишку');
  }
}

/// Завдання 3: Логічні оператори
/// Створіть змінні hasMoney і isStoreOpen (типу bool).
///
/// Перевірте:
/// Чи можна зробити покупку (якщо є гроші і магазин відкритий).
/// Чи потрібно почекати (якщо магазин закритий або немає грошей).
/// Використайте оператори &&, ||, !.
void task3() {
  const minMoney = 100;
  const maxMoney = 1000;
  const maxHour = 24;

  final myMoney = Random().nextInt((maxMoney + 1) - minMoney) + minMoney;
  final price = Random().nextInt((maxMoney + 1) - minMoney) + minMoney;
  final curentTime = Random().nextInt(maxHour + 1);

  print('Task3: Логічні оператори');
  print(' Мої гроші: $myMoney');
  print(' Ціна товару: $price');
  print(' Поточний час: $curentTime');

  final hasMoney = myMoney >= price;
  final isStoreOpen = curentTime >= 10 && curentTime < 21;

  if (hasMoney && isStoreOpen) {
    print(' Можна зробити покупку');
  } else if (!isStoreOpen && hasMoney) {
    print(' Потрібно почекати доки магазин відкриється');
  } else if (!isStoreOpen && !hasMoney) {
    print(' Потрібно почекати доки магазин відкриється та мати більше грошей');
  } else {
    print(' Не можна зробити покупку, бо не вистачає грошей');
  }
}

/// Завдання 4: Тернарний оператор
/// Створіть змінну temperature.
///
/// Використайте тернарний оператор, щоб визначити:
/// Якщо більше 25 — “Тепло”.
/// Якщо менше або дорівнює 25 — “Прохолодно”.
/// Потім створіть ще один тернарний оператор:
/// Якщо менше 10 — вивести “Дуже холодно”.

void task4() {
  const maxTemp = 55;
  const minTemp = -10;

  final temperature = Random().nextInt((maxTemp + 1) - minTemp) + minTemp;
  print('Task 4: Тернарний оператор');
  print(
    ' Температура $temperature - '
    '${temperature > 25
        ? 'Тепло'
        : temperature < 10
        ? 'Дуже холодно'
        : 'Прохолодно'}',
  );
}

/// Завдання 5: Оператори присвоєння
/// Використовувати тільки оператори присвоєння (+=, -=, *=, /=)
///
/// Створіть змінну score = 0.
/// Створіть зміни з даними:
/// correctAnswers = 17;
/// mistakes = 3;
/// totalQuestions = 20;
///
/// Додайте 10 балів за кожну правильну відповідь.
/// Відніміть 5 балів за кожну помилку.
///
/// Збільшіть загальну кількість балів у 2 рази.
/// Поділіть бали на кількість запитань.
/// Виведіть остаточний результат.

void task5() {
  const correctAnswers = 17;
  const mistakes = 3;
  const totalQuestions = 20;

  var score = 0.0;
  score += correctAnswers * 10; // Додайте 10 балів за кожну правильну відповідь
  score -= mistakes * 5; // Відніміть 5 балів за кожну помилку
  score *= 2; // Збільшіть загальну кількість балів у 2 рази
  score /= totalQuestions; // Поділіть бали на кількість запитань

  print('Task 5: Оператори присвоєння');
  print(' Остаточний результат: $score');
}

/// Завдання 6: Умовні конструкції if/else
/// Створіть змінну examScore з значенням 56
/// Створіть умовні конструкції if / else if / else
/// Якщо більше 90 — вивести “Відмінно”.
///
/// Якщо 75–90 — “Добре”.
/// Якщо 60–74 — “Задовільно”.
/// Якщо менше 60 — “Не здано”.
///
/// Додатково: якщо оцінка менше 20 — вивести “Повторити курс”.
/// Поексперементуйте, змінюючи  значення examScore

void task6() {
  final examScore = Random().nextInt(101);
  print('Task 6: Умовні конструкції if/else');
  print(' Оцінка: $examScore');

  if (examScore > 90) {
    print(' Відмінно');
  } else if (examScore >= 75) {
    print(' Добре');
  } else if (examScore >= 60) {
    print(' Задовільно');
  } else {
    print(' Не здано');
    if (examScore < 20) {
      print(' Повторити курс');
    }
  }
}

/// Завдання 7: Конструкція switch statement
/// Створіть змінну dayNumber від 1 до 7.
///
/// Використайте switch, щоб вивести:
/// Понеділок, Вівторок, …, Неділя.
/// Якщо день не від 1 до 7 — вивести “Невірний номер дня”.
/// Додатково: для вихідних (6, 7) вивести “Вихідний день 🎉”.

void task7() {}

/// Завдання 8: Цикли for
/// Виведіть всі числа від 1 до 10.
/// Виведіть тільки парні числа.
/// Обчисліть суму чисел від 1 до 10.

void task8() {}

/// Завдання 9: Цикл while
/// Почніть із числа 10.
///
/// Виводьте числа, зменшуючи їх на 1, поки не досягнете 0.
/// Якщо число парне — вивести “Парне число: …”,
/// якщо непарне — “Непарне число: …”.

void task9() {}

/// Завдання 10: Break і Continue
/// Створіть цикл for від 1 до 20.
///
/// Якщо число ділиться на 3 без залишку — пропустіть його (continue).
/// Якщо число більше 15 — зупиніть цикл (break).
/// Виведіть тільки ті числа, які пройшли обидві перевірки.
void task10() {}
